#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mgoogle_project_service.enabled_apis["iam.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/iam.googleapis.com][0m
[0m[1mgoogle_storage_default_object_access_control.website_read: Refreshing state... [id=resume_bucket02934502349/allUsers][0m
[0m[1mgoogle_project_service.enabled_apis["run.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/run.googleapis.com][0m
[0m[1mgoogle_storage_bucket.resume_bucket: Refreshing state... [id=resume_bucket02934502349][0m
[0m[1mgoogle_service_account.tf-sa: Refreshing state... [id=projects/cloud-resume-challenge-361611/serviceAccounts/terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_service.enabled_apis["cloudbuild.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/cloudbuild.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["serviceusage.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/serviceusage.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["dns.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/dns.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/cloudresourcemanager.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["compute.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/compute.googleapis.com][0m
[0m[1mgoogle_service_account_key.sa_key: Refreshing state... [id=projects/cloud-resume-challenge-361611/serviceAccounts/terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com/keys/f7499d28ed355d26be2af06f1f0c893d3e366500][0m
[0m[1mgoogle_project_iam_member.tf-sa-binding["roles/owner"]: Refreshing state... [id=cloud-resume-challenge-361611/roles/owner/serviceAccount:terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.tf-sa-binding["roles/storage.admin"]: Refreshing state... [id=cloud-resume-challenge-361611/roles/storage.admin/serviceAccount:terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [31m-[0m destroy
[0m
Terraform will perform the following actions:

[1m  # google_storage_bucket_access_control.public_rule[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket_access_control" "public_rule" {
      [32m+[0m [0m[1m[0mbucket[0m[0m = "resume_bucket02934502349"
      [32m+[0m [0m[1m[0mdomain[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0memail[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mentity[0m[0m = "allUsers"
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m   = "READER"
    }

[1m  # google_storage_default_object_access_control.website_read[0m will be [1m[31mdestroyed[0m
  # (because google_storage_default_object_access_control.website_read is not in configuration)[0m
[0m  [31m-[0m[0m resource "google_storage_default_object_access_control" "website_read" {
      [31m-[0m [0m[1m[0mbucket[0m[0m       = "resume_bucket02934502349" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mentity[0m[0m       = "allUsers" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mgeneration[0m[0m   = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m           = "resume_bucket02934502349/allUsers" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject_team[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mrole[0m[0m         = "READER" [90m->[0m [0m[90mnull[0m[0m
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @jamesfricker, Action: `pull_request`, Working Directory: ``, Workflow: `deployment`*